In [1]:
import pandas as pd

In [2]:
import sys

In [3]:
sys.path

['/home/kevin/Escritorio/python/Data_science/Week_2',
 '/usr/lib/python38.zip',
 '/usr/lib/python3.8',
 '/usr/lib/python3.8/lib-dynload',
 '',
 '/home/kevin/.local/lib/python3.8/site-packages',
 '/usr/local/lib/python3.8/dist-packages',
 '/usr/lib/python3/dist-packages',
 '/usr/lib/python3/dist-packages/IPython/extensions',
 '/home/kevin/.ipython']

In [4]:
purchase_1 = pd.Series({
    'Name':'Chris',
    'Item Purchased':'Dog Food',
    'Cost':22.50,
})

purchase_2 = pd.Series({
    'Name':'Kevyn',
    'Item Purchased':'Kitty Litter',
    'Cost':2.50,
})

purchase_3 = pd.Series({
    'Name':'Vinod',
    'Item Purchased':'Bird Seed',
    'Cost':5.00,
})

df = pd.DataFrame([purchase_1,purchase_2,purchase_3], index=['Store 1','Store 2','Store 3'])
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 2  Kevyn   Kitty Litter   2.5
Store 3  Vinod      Bird Seed   5.0

In [5]:
df.loc['Store 2']

Name                     Kevyn
Item Purchased    Kitty Litter
Cost                       2.5
Name: Store 2, dtype: object

In [6]:
type(df.loc['Store 2'])

pandas.core.series.Series

In [7]:
df = pd.DataFrame([purchase_1,purchase_2,purchase_3], index=['Store 1','Store 1','Store 2'])
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [8]:
df.loc['Store 1']

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5

In [9]:
df['Item Purchased']

Store 1        Dog Food
Store 1    Kitty Litter
Store 2       Bird Seed
Name: Item Purchased, dtype: object

In [10]:
df.loc['Store 1','Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [11]:
df.T

                 Store 1       Store 1    Store 2
Name               Chris         Kevyn      Vinod
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5

In [12]:
df.T.loc['Cost']

Store 1    22.5
Store 1     2.5
Store 2       5
Name: Cost, dtype: object

In [13]:
df.loc[:,['Name','Cost']]

          Name  Cost
Store 1  Chris  22.5
Store 1  Kevyn   2.5
Store 2  Vinod   5.0

In [14]:
df.drop('Store 1')

          Name Item Purchased  Cost
Store 2  Vinod      Bird Seed   5.0

In [15]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [16]:
copy_df = df.copy()
copy_df = df.drop('Store 1')
copy_df

          Name Item Purchased  Cost
Store 2  Vinod      Bird Seed   5.0

In [17]:
del df['Cost']
df

          Name Item Purchased
Store 1  Chris       Dog Food
Store 1  Kevyn   Kitty Litter
Store 2  Vinod      Bird Seed

In [18]:
df['Location']= None
df

          Name Item Purchased Location
Store 1  Chris       Dog Food     None
Store 1  Kevyn   Kitty Litter     None
Store 2  Vinod      Bird Seed     None

In [21]:
purchase_1 = pd.Series({
    'Name':'Chris',
    'Item Purchased':'Dog Food',
    'Cost':22.50,
})

purchase_2 = pd.Series({
    'Name':'Kevyn',
    'Item Purchased':'Kitty Litter',
    'Cost':2.50,
})

purchase_3 = pd.Series({
    'Name':'Vinod',
    'Item Purchased':'Bird Seed',
    'Cost':5.00,
})

df = pd.DataFrame([purchase_1,purchase_2,purchase_3], index=['Store 1','Store 1','Store 3'])
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 3  Vinod      Bird Seed   5.0

In [20]:
df['Cost']*= 0.8
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  18.0
Store 2  Kevyn   Kitty Litter   2.0
Store 3  Vinod      Bird Seed   4.0